# Construction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Construction Property
GroupTypeId Class See Also
---
Construction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Construction { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Construction As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Construction {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace